"""Снабди каждый комментарий правильной командой."""

python3 -V  # команда для проверки текущей версии Питона
python # запуск интерпретатора Питона в режиме REPL
virtualenv PRG1 # создание виртуального окружения в текущей директории. PRG - имя виртуального окружения
source PRG1/bin/activate # активация вышесозданного виртуального окружения
deactivate # деактивация виртуального окружения
python run.py # запуск скрипта run.py находящегося в текущей директории
pip install requests  # установка пакета requests через пакетный менеджер pip
