"""Задания по стилю кода и именованию переменных."""

# напиши команду, которая проверяет, ссылаются ли
# переменные spam и eggs на один и тот же объект в пямяти
spam = None
eggs = None

if spam == eggs:
    print("it is the same objekt")

# придумай название для переменной, которая хранит список
# активных студентов, оставь этот список пустым
activ_st = []

# назови переменную, которая хранит текущее количество студентов в потоке
st = 99
# придумай две переменных для обозначения самого маленького и самого большого
# числа в диапазоне и запиши в них числа 1 и 45
smallest_number = 1
biggest_number = 45

# создай константу для хранения числа Пи и запиши в неё первые 10 знаков
import math
pi = round(math.pi, 10)
print(pi)
